class Chapter {
  final String title;
  final Map<String, String> verse;
  final Map<String, String> translation;

  Chapter({
    required this.title,
    required this.verse,
    required this.translation,
  });
}

class ChapterData {
  static List<Chapter> chapters = [
    Chapter(
      title: '১.বিষাদ যোগ',
      verse: {
        'শ্লোক১':
            '''ধৃতরাষ্ট্র উবাচ :
ধর্মক্ষেত্রে কুরুক্ষেত্রে সমবেতা যুযুৎসবঃ।
মামকাঃ পান্ডবাশ্চৈব কিমকুর্বত সঞ্জয়।।১।।''',
        'শ্লোক২': '''সঞ্জয় উবাচ :
দৃষ্ট্বা তু পাণ্ডবানীকং ব্যূঢ়ং দুর্যোধনস্তদা। 
আচার্যমুপসঙ্গম্য রাজা বচনমব্রবীৎ।।২।। ''',
        'শ্লোক৩': '''
পশ্যৈতাং পান্ডুপুত্রাণামাচার্য মহতীং চমূম্ ।
ব্যূঢ়াং দ্রুপদপুত্রেণ তব শিষ্যেণ ধীমতা।।৩।।''',
        'শ্লোক৪': '''
অত্র শূরা মহেষ্বাসা ভীমার্জুনসমা যুধি।
যুযুধানো বিরাটশ্চ দ্রুপদশ্চ মহারথঃ।।৪।।
ধৃষ্টকেতুশ্চেকিতানঃ কাশিরাজশ্চ বীর্যবান্ ।
পুরুজিৎ কুন্তিভোজশ্চ শৈব্যশ্চ নরপুঙ্গবঃ।।৫।।
যুধামন্যুশ্চ বিক্রান্ত উত্তমৌজাশ্চ বীর্যবান্ ।
সৌভদ্রো দ্রৌপদেয়াশ্চ সর্ব এব মহারথাঃ ।।৬।।''',
        'শ্লোক৫': '''
অস্মাকন্ত বিশিষ্টা যে তান্নিবোধ দ্বিজোত্তম। 
নায়কা মম সৈন্যস্য সংজ্ঞার্থং তান্ ব্রবীমি তে।।৭।।''',
        'শ্লোক৬': '''
ভবান্ ভীষ্মশ্চ কর্ণশ্চ কৃপশ্চ সমিতিঞ্জয়ঃ। 
অশ্বত্থামা বিকর্ণশ্চ সৌমদত্তিস্তথৈব চ।।৮।।''',
        'শ্লোক৭': '''
অন্যে চ বহুবঃ শূরা মদর্থে ত্যক্তজীবিতাঃ। 
নানাশস্ত্রপ্রহরণাঃ সর্বে যুদ্ধবিশারদাঃ।।৯।।''',
        'শ্লোক৮': '''
অপর্যাপ্তং তদস্মাকং বলং ভীষ্মাভিরক্ষিতম্ । 
পর্যাপ্তং ত্বিদমেতেষাং বলং ভীমাভিরক্ষিতম্ ।।১০।।
অয়নেষু চ সর্বেষু যথাভাগমস্থিতাঃ।
ভীষ্মমেবাভিরক্ষস্ত ভবন্তঃ সর্ব এব হি।।১১।।''',
        'শ্লোক৯': '''
তস্য সঞ্জনয়ন্ হর্ষং কুরুবৃদ্ধঃ পিতামহঃ। 
সিংহনাদং বিনদ্যাচ্চৈঃ শঙ্খং দধ্মৌ প্রতাপবান্ ।।১২।।''',
        'শ্লোক১০': '''
ততঃ শঙ্খাশ্চ ভের্যশ্চ পণবানকগোমুখাঃ ।
সহসৈবাভ্যহন্যস্ত স শব্দস্তুমুলোহভবৎ।।১৩।।''',
        'শ্লোক১১': '''
ততঃ শ্বেতৈর্হয়ৈর্যুক্তে মহতি স্যন্দনে স্থিতৌ। 
মাধবঃ পান্ডবশ্চৈব দিব্যৌ শঙ্খৌ প্রদ্ধমতুঃ।।১৪।।''',
        'শ্লোক১২': '''
পাঞ্চজন্যং হৃষীকেশো দেবদত্তং ধনঞ্জয়ঃ। 
পৌন্ড্রং দধ্মৌ মহাশঙ্খং ভীমকর্মা বৃকদরঃ।।১৫।।''',
        'শ্লোক১৩': '''
অনন্তবিজয়ং রাজা কুন্তীপুত্রো যুধিষ্ঠিরঃ। 
নকুলঃ সহদেবশ্চ সুঘোষমণিপুষ্পকৌ।।১৬।।
কাশ্যশ্চ পরমেষ্বাসঃ শিখন্ডী চ মহারথঃ। 
ধৃষ্টদ্যুম্নো বিরাটশ্চ সাত্যকিশ্চাপরাজিতঃ।।১৭।।
দ্রুপদো দ্রৌপদেয়াশ্চ সর্বশঃ পৃথিবীপতে। 
সৌভদ্রশ্চ মহাবাহুঃ শঙ্খান্ দধ্মুঃ পৃথক্ পৃথক্।।১৮।।''',
        'শ্লোক১৪': '''
স ঘোষো ধার্তরাষ্ট্রাণাং হৃদয়ানি ব্যদারয়ৎ। 
নভশ্চ পৃথিবীং চৈব তুমুলোহভ্যনুনাদয়ন্ ।।১৯।।''',
        'শ্লোক১৫': '''
অথ ব্যবস্থিতান্ দৃষ্ট্বা ধার্তরাষ্ট্রান্ কপিধ্বজঃ। 
প্রবৃত্তে শস্ত্রসম্পাতে ধনুরুদ্যম্য পান্ডবঃ। 
হৃষীকেশং তদা বাক্যমিদমাহ মহীপতে।।২০।।''',
        'শ্লোক১৬': '''
সেনয়োরুভয়োর্মধ্যে রথং স্থাপয় মেহচ্যুত। 
যাবদেতান্নিরীক্ষেহহং যোদ্ধুকামানবস্থিতান্ ।।২১।।
কৈর্ময়া সহ যোদ্ধব্যমস্মিন্ রণসমুদ্যমে।।২২।।''',
        'শ্লোক১৭': '''
যোৎস্যমানানবেক্ষেহহং য এতেহত্র সমাগতাঃ। 
ধার্তরাষ্ট্রস্য দুর্বদ্ধের্যুদ্ধে প্রিয়চিকীর্ষবঃ।।২৩।।''',
        'শ্লোক১৮': '''
এবমুক্তো হৃষীকেশো গুড়াকেশেন ভারত। 
সেনয়োরুভয়োর্মধ্যে স্থাপয়িত্বা রথোত্তমম্।।২৪।।''',
        'শ্লোক১৯': '''
ভীষ্মদ্রোণপ্রমুখতঃ সর্বেষাং চ মহীক্ষিতাম্ । 
উবাচ পার্খ পশ্যৈতান্ সমবেতান্ কুরূনিতি।।২৫।।''',
        'শ্লোক২০': '''
তত্রাপশ্যৎ স্থিতান্ পার্থঃ পিতৃনথ পিতামহান্। 
আচার্যান্মাতুলান্ ভ্রাতৃন্ পুত্রান্ পৌত্রান্ সখীংস্তথা। 
শ্বশুরান্ সুহৃদশ্চৈব সেনয়োরুভয়োরপি।।২৬।।''',
        'শ্লোক২১': '''
তান্ সমীক্ষ্য স কৌন্তেয়ঃ সর্বান্ বন্ধুনবস্থিতান্। 
কৃপয়া পরায়াবিষ্টো বিষীদন্নিদমব্রবীৎ।।২৭।।''',
        'শ্লোক২২':
            '''অর্জুন উবাচ :
দৃষ্ট্বেমং স্বজনং কৃষ্ণ যুযুৎসুং সমুপস্থিতম্। 
সীদন্তি মম গাত্রাণি মুখং চ পরিশুষ্যতি।।২৮।।''',
        'শ্লোক২৩': '''
বেপথুশ্চ শরীরে মে রোমহর্যশ্চ জায়তে। 
গান্ডীবং স্রংসতে হস্তাৎ ত্বক্ চৈব পরিদহ্যতে।।২৯।।''',
        'শ্লোক২৪': '''
ন চ শক্নোম্যবস্থাতুং ভ্রুমতীব চ মে মনঃ। 
নিমিত্তানি চ পশ্যামি বিপরীতানি কেশব।।৩০।।''',
        'শ্লোক২৫': '''
ন চ শ্রেয়োহনুপশ্যামি হত্বা স্বজনমাহবে। 
ন কাঙ্ক্ষে বিজয়ং কৃষ্ণ ন চ রাজ্যং সুখানি চ।।৩১।।''',
        'শ্লোক২৬': '''
কিং নো রাজ্যেন গোবিন্দ কিং ভোগৈর্জীবিতেন বা। 
যেষামর্থে কাঙ্ক্ষিতং নো রাজ্যং ভোগাঃ সুখানি চ।।৩২।।
ত ইমেহবস্থিতা যুদ্ধে প্রাণাংস্ত্যক্তা ধনানি চ। 
আচার্যাঃ পিতরঃ পুত্রাস্তথৈব চ পিতামহাঃ।।৩৩।।
মাতুলাঃ শ্বশুরাঃ পৌত্রাঃ শ্যালাঃ সম্বন্ধিনস্তথা। 
এতান্ন হস্তুমিচ্ছামি ঘ্নতোহপি মধূসূদন।।৩৪।।
অপি ত্রৈলোক্যরাজ্যস্য হেতোঃ কিং নু মহীকৃতে। 
নিহত্য ধার্তরাষ্ট্রন্নঃ কা প্রীতিঃ স্যাজ্জনার্দন।।৩৫।।''',
        'শ্লোক২৭': '''
পাপমেবাশ্রয়েদস্মান্ হত্বৈতানাততায়িনঃ। 
তস্মান্নার্হা বয়ং হস্তুং ধার্তরাষ্ট্রান্ সবান্ধবান্ । 
স্বজনং হি কথং হত্বা সুখিনঃ স্যাম মাধব।।৩৬।।''',
        'শ্লোক২৮': '''
যদ্যপ্যেতে ন পশ্যন্তি লোভোপহতচেতসঃ। 
কুলক্ষয়কৃতং দোষং মিত্রদ্রোহে চ পাতকম্।।৩৭।।
কথং ন জ্ঞেয়মস্মাভিঃ পাপাদস্মান্নিবর্তিতুম্।
কুলক্ষয়কৃতং দোষং প্রপশ্যদ্ভির্জনার্দন।।৩৮।।''',
        'শ্লোক২৯': '''
কুলক্ষয়ে প্রণশ্যন্তি কুলধর্মাঃ সনাতনাঃ। 
ধর্মে নষ্টে কুলং কৃৎস্নমধর্মোহভিভবত্যুত।।৩৯।।''',
        'শ্লোক৩০': '''
অধর্মাভিভবাৎ কৃষ্ণ প্রদুষ্যন্তি কুলুস্ত্রয়ঃ। 
স্ত্রীষু দুষ্টাসু বার্ষ্ণেয় জায়তে বর্ণসঙ্করঃ।।৪০।।''',
        'শ্লোক৩১': '''
সঙ্করো নরকায়ৈব কুলঘ্নানাং কুলস্য চ। 
পতন্তি পিতরো হ্যেষাং লুপ্তপিন্ডোদকক্রিয়াঃ।।৪১।।''',
        'শ্লোক৩২': '''
দোষৈরেতৈঃ কুলঘ্নানাং বর্ণস্করকৈঃ। 
উৎসাদ্যন্তে জাতিধর্মাঃ কুলধর্মাশ্চ শাশ্বতাঃ।।৪২।।''',
        'শ্লোক৩৩': '''
উৎসন্নকুলধর্মাণাং মনষ্যাণাং জনার্দন। 
নরকে নিয়তং বাসো ভবতীত্যনুশুশ্রুম।।৪৩।।''',
        'শ্লোক৩৪': '''
অহো বত মহৎ পাপং কর্তুং ব্যবসিতা বয়ম্।
যদ্ রাজ্যসুখলোভেন হস্তুং স্বজনমুদ্যতাঃ।।৪৪।।''',
        'শ্লোক৩৫': '''
যদি মামপ্রতীকারমশস্ত্রং শস্ত্রপাণয়ঃ। 
ধার্তরাষ্ট্রা রণে হন্যুস্তন্মে ক্ষেমতরং ভবেৎ।।৪৫।।''',
        'শ্লোক৩৬': '''
এবমুক্তার্জুনঃ সংখ্যে রথোপস্থ উপাবিশৎ। 
বিসৃজ্য সশরং চাপং শোকসংবিগ্নমানসঃ।।৪৬।।''',
      },
      translation: {
        'শ্লোক১':
            '''ধৃতরাষ্ট্র জিজ্ঞাসা করলেন- হে সঞ্জয়! ধর্মক্ষেত্রে যুদ্ধ করার মানসে সমবেত হয়ে আমার পুত্র এবং পান্ডুর পুত্রেরা তারপর কি করল?''',
        'শ্লোক২':
            '''সঞ্জয় বললেন-হে রাজন্! পান্ডবদের সৈন্যসজ্জা দর্শন করে রাজা দুর্যোধন দ্রোণাচার্যের কাছে গিয়ে বললেন''',
        'শ্লোক৩':
            '''হে আচার্য! পান্ডবদের মহান সৈন্যবল দর্শন করুন, যা আপনার অত্যন্ত বুদ্ধিমান শিষ্য দ্রুপদের পুত্র অত্যন্ত দক্ষতার সঙ্গে বূহ্যের আকারে রচনা করেছেন।''',
        'শ্লোক৪':
            '''সেই সমস্ত সেনাদের মধ্যে অনেকে ভীম ও অর্জুনের মতো বীর ধনুর্ধারী রয়েছেন এবং যুযুধান ও দ্রুপদের মতো মহাযোদ্ধা রয়েছেন। সেখানে ধৃষ্টকেতু,চেকিতান, কাশিরাজ,পুরুজিৎ, কুন্তিভোজ ও শৈব্যের মতো অত্যন্ত বলবান যোদ্ধারাও রয়েছেন। সেখানে রয়েছেন অত্যন্ত বলবান যুধামন্যু, প্রবল পরাক্রমশালী উত্তমৌজা,সুভদ্রার পুত্র এবং দ্রৌপদীর পুত্রগণ। এই সব যোদ্ধারা সকলেই এক-একজন মহারধী। ''',
        'শ্লোক৫':
            '''হে দ্বিজোত্তম! আমাদের পক্ষে যে সমস্ত বিশিষ্ট সেনাপতি সামরিক শক্তিপরিচালনার জন্য রয়েছেন, আপনার অবগতির জন্য আমি তাঁদের সম্বন্ধে বলছি।''',
        'শ্লোক৬':
            '''সেখানে রয়েছেন আপনার মতোই ব্যক্তিত্বশালী-ভীষ্ম,কর্ণ, কৃপা, অশ্বত্থামা,বিকর্ণ ও সোমদত্তের পুত্র ভূরিশ্রবা, যাঁরা সর্বদা সংগ্রামে বিজয়ী হয়ে খাকেন।''',
        'শ্লোক৭':
            '''এ ছাড়া আরও বহু সেনানায়ক রয়েছেন, যাঁরা আমার জন্য তাঁদের জীবন ত্যাগ করতে প্রস্তুত। তাঁরা সকলেই নানা প্রকার অস্ত্রশস্ত্রে সজ্জিত এবংতাঁরা সকলেই সামরিক বিজ্ঞানে বিশারদ। ''',
        'শ্লোক৮':
            '''আমাদের সৈন্যবল অপরিমিত এবং আমরা পিতামহ ভীষ্মের দ্বারা পূর্ণরূপেসুরক্ষিত, কিন্ত ভীমের দ্বারা সতর্কভাবে সুরক্ষিত পান্ডবদের শক্তি সীমিত। এখন আপনারা সকলে সেনাব্যূহের প্রবেশপথে নিজ নিজ গুরুত্বপূর্ণ স্থানে স্থিত হয়ে পিতামহ ভীষ্মকে সর্বতোভাবে সাহায্য প্রদান করুন। ''',
        'শ্লোক৯':
            '''তখন কুরুবংশের বৃদ্ধ পিতামহ ভীষ্ম দুর্যোধনের হর্ষ উৎপাদনেরজন্য সিংহের গর্জনের মতো অতি উচ্চনাদে তাঁর শঙ্খ বাজালেন।''',
        'শ্লোক১০':
            '''তারপর শঙ্খ, ভেরী, পণব,আনক, ঢাক ও গোমুখ শিঙাসমূহ হঠাৎ একত্রে ধ্বনিত হয়ে এক তুমুল শব্দের সৃষ্টি হল। ''',
        'শ্লোক১১':
            '''অন্য দিকে, শ্বেত অশ্বযুক্ত এক দিব্য রথে স্থিত শ্রীকৃষ্ণ ও অর্জুন উভয়ে তাঁদের দিব্য শঙ্খ বাজালেন। ''',
        'শ্লোক১২':
            '''তখন, শ্রীকৃষ্ণ পাঞ্চজন্য নামক তাঁর শঙ্খ বাজালেন, অর্জুন বাজালেন তাঁর দেবদত্ত নামক শঙ্খ এবং বিপুল ভোজনপ্রিয় ও ভীমকর্মা ভীমসেন বাজালেন পৌন্ড্র নামক তাঁর ভয়ংকর শঙ্খ। ''',
        'শ্লোক১৩':
            '''কুন্তীপুত্র মহারাজ যুধিষ্ঠির অনন্তবিজয় নামক শঙ্খ বাজালেন এবং নকুল ও সহদেব বাজালেন সুঘোষ ও মণিপুষ্প নামক শঙ্খ। হেমহারাজ!তখন মহান ধনুর্ধর কাশীরাজ, প্রবল যোদ্ধা শিখন্ডী, ধৃষ্টদ্যুম্ন,বিরাট, অপরাজিত সাত্যকি, দ্রুপদ, দ্রৌপদীর পুত্রগণ, সুভদ্রার মহা বলবান পুত্র এবং অন্য সকলে তাঁদের নিজ নিজ পৃথক শঙ্খ বাজালেন। ''',
        'শ্লোক১৪':
            '''শঙ্খ-নিনাদের সেই প্রচন্ড শব্দ আকাশ ও পৃথিবী প্রতিধ্বনিত করে ধৃতরাষ্ট্রের পুত্রদের হৃদয় বিদারিত করতে লাগল। ''',
        'শ্লোক১৫':
            '''সেই সময় পান্ডুপুত্র অর্জুন হনুমান চিহ্নিত পতাকা শোভিত রথে অধিষ্ঠিত হয়ে. তাঁর ধনুক তুলে নিয়ে শর নিক্ষেপ করতে প্রস্তুত হলেন। হে মহারাজ!ধৃতরাষ্ট্রের পুত্রদের সমরসজ্জায় বিন্যস্ত দেখে, অর্জুন তখন শ্রীকৃষ্ণকে এই কথাগুলি বললেন-''',
        'শ্লোক১৬':
            '''অর্জুন বললেন- হে অচ্যুত! তুমি উভয় পক্ষের সৈন্যদের মাঝখানে আমার রথ স্থাপন কর, যাতে আমি দেখতে পারি যুদ্ধ করার অভিলাষী হয়ে কারা এখানে এসেছে এবং এই মহা সংগ্রামে আমাকে কাদের সঙ্গে যুদ্ধ করতে হবে।  ''',
        'শ্লোক১৭':
            '''ধৃতরাষ্ট্রের দুর্বুদ্ধিসম্পন্ন পুত্রকে সন্তুষ্ট করার বাসনা করে যারা এখানে যুদ্ধ করতে এসেছে, তাদের আমি দেখতে চাই। ''',
        'শ্লোক১৮':
            '''সঞ্জয় বললেন-হে ভরত-ভংশধর!অর্জুন কর্তৃক এভাবে আদিষ্ট হয়ে, শ্রীকৃষ্ণ সেই অতি উত্তম রথটি চালিয়ে নিয়ে উভয় পক্ষের সৈন্যদের মাঝখানে রাখলেন। ''',
        'শ্লোক১৯':
            '''ভীষ্ম, দ্রোণ প্রমুখ পৃথিবীর অন্য সমস্ত নৃপতিদের সামনে ভগবান হৃষীকেশ বললেন, হে পার্থ! এখানে সমবেত সমস্ত কৌরবদের দেখ। ''',
        'শ্লোক২০':
            '''তখন অর্জুন উভয় পক্ষের সেনাদলের মধ্যে পিতৃব্য, পিতামহ, আচার্য, মাতুল, ভ্রাতা, পুত্র, পৌত্র,  শশুর, মিত্র ও শুভাকাঙ্খীদের উপস্থিত দেখতে পেলেন। ''',
        'শ্লোক২১':
            '''যখন কুন্তীপুত্র অর্জুন সকল রকমের বন্ধু ও আত্মীয়-স্বজনদের যুদ্ধক্ষেত্রে অবস্থিত দেখলেন, তখন তিনি  অত্যন্ত কৃপাবিষ্ট ও বিষণ্ণ হয়ে বললেন। ''',
        'শ্লোক২২':
            '''অর্জুন বললেন- হে প্রিয়বর কৃষ্ণ! আমার সমস্ত বন্ধুবান্ধব ও আত্মীয়- স্বজনদের এমনভাবে যুদ্ধাভিলাষী হয়ে আমার সামনে অবস্থান করতে দেখে আমার অঙ্গ-প্রত্যঙ্গ অবশ হচ্ছে এবং মুখ শুষ্ক হয়ে উঠছে।''',
        'শ্লোক২৩':
            '''আমার সর্বশরীর কম্পিত ও রোমাঞ্চিত হচ্ছে, আমার হাত থেকে গান্ডীব খসে পড়ছে এবং ত্বক যেন জ্বলে যাচ্ছে। ''',
        'শ্লোক২৪':
            '''হে কেশব! আমি এখন আর স্থির থাকতে পারছি না। আমি আত্মবিস্মৃত হচ্ছি এবং আমার চিত্ত উদভ্রান্ত হচ্ছে। হে কেশী দানবহন্তা শ্রীকৃষ্ণ! আমি কেবল অমঙ্গলসূচক লক্ষণসমূহ দর্শন করছি। ''',
        'শ্লোক২৫':
            '''হে কৃষ্ণ! যুদ্ধে আত্মীয়-স্বজনদের নিধন করা শ্রেয়স্কর দেখছি না। আমি যুদ্ধে জয়লাভ চাই না, রাজ্য এবং সুখভোগও কামনা করি না। ''',
        'শ্লোক২৬':
            '''হে গোবিন্দ! আমাদের রাজ্যে কি প্রয়োজন, আর সুখভোগ বা জীবন ধারণেই বা কী প্রয়োজন, যখন দেখছি-যাদের জন্য রাজ্য ও ভোগসুখের কামনা, তারা সকলেই এই রণক্ষেত্রে আজ উপস্থিত? হে মধুসূদন! যখন আচার্য,পতিৃব্য,পুত্র, পিতামহ, মাতুল, শ্বশুর, পৌত্র, শ্যালক ও আত্মীয়স্বজন, সকলেই প্রাণ ও ধনাদির আশা পরিত্যাগ করে  আমার সামনে যুদ্ধে উপস্থিত হয়েছেন, তখন তাঁরা আমাকে বধ করলেও আমি তাঁদের হত্যা করতে চাইব কেন? যেসমস্ত জীবের প্রতিপালক জনার্দন! পৃথিবীর তো কথাই নেই, এমন কি সমগ্র ত্রিভুবনের বিনিময়েও আমি যুদ্ধ  করতে প্রস্তুত নই। ধৃতরাষ্ট্রের পুত্রদের নিধন করে কি সন্তোষ আমরা লাভ করতে পারব? ''',
        'শ্লোক২৭':
            '''এই ধরনের আততায়ীদের বধ করলে মহাপাপ আমাদের আচ্ছন্ন করবে। সুতরাং বন্ধুবান্ধব সহ ধৃতরাষ্ট্রেরপুত্রদের সংহার করা আমাদের পক্ষে অবশ্যই উচিত হবে না। হে মাধব, লক্ষীপতি শ্রীকৃষ্ণ!আত্মীয়-স্বজনদের হত্যা করে  আমাদের কী লাভ হবে? আর তা থেকে আমরা কেমন করে সুখী হব? ''',
        'শ্লোক২৮':
            '''হে জনার্দন! যদিও এরা রাজ্যলোভে অভিভুত হয়ে  কুলক্ষয় জনিত দোষ ওমিত্রদ্রোহ নিমিত্ত পাপ লক্ষ্য করছে না, কিন্তু আমরা কুলক্ষয় জনিত দোষ লক্ষ্য করেও এই পাপকর্মে কেন প্রবুত্ত হব?''',
        'শ্লোক২৯':
            '''কুলক্ষয় হলেও সনাতন কুলধর্ম বিনষ্ট হয় এবং তা হলে সমগ্র বংশ অধর্মে অভিভুত হয়। ''',
        'শ্লোক৩০':
            '''হে কৃষ্ণ! কুল অধর্মের দ্বারা অভিভুত হলে কুলবধূগণ ব্যভিচারে প্রবুত্ত হয় এবং হে বার্ষ্ণেয়! কুলস্ত্রীগণ অসৎ চরিত্রা হলে অবাঞ্চিত প্রজাতি উৎপন্ন হয়। ''',
        'শ্লোক৩১':
            '''বর্ণসঙ্কর উৎপাদন বৃদ্ধি হলে কুল ও কুলঘাতকেরা নরকগামী হয়।সেইকুলে পিন্ডদান ও তর্পণক্রিয়া লোপ পাওয়ার ফলে তাদের পিতুপুরুষেরাও নরকে অধঃপতিত হয়। ''',
        'শ্লোক৩২':
            '''যারা বংশের ঐতিহ্য নষ্ট করে এবং কার ফলে অবাঞ্চিত সন্তানাদি সৃষ্টি করে, তাদের কুকর্মজনিত দোষের ফলে সর্বপ্রকার জাতীয় উন্নয়ন প্রকল্প এবং বংশের কল্যাণ-ধর্ম উৎসন্নে যায়। ''',
        'শ্লোক৩৩':
            '''হে জনার্দন!আমি পরম্পরাক্রমে শুনেছি যে, যাদের কুলধর্ম বিনষ্ট হয়েছে, তাদের নিয়ত নরকে বাস করতে হয়। ''',
        'শ্লোক৩৪':
            '''হায়! কী আশ্চর্যের বিষয় যে, আমরা রাজ্যসুখের লোভে স্বজনদের হত্যা করতে উদ্যত হয়ে মহাপাপ করতে সংকল্পবদ্ধ হয়েছি। ''',
        'শ্লোক৩৫':
            '''প্রতিরোধ রহিত ও নিরস্ত্র অবস্থায় আমাকে যদি শস্ত্রধারী ধৃতরাষ্ট্রের পুত্রেরা যুদ্ধে বধ করে, তা হলে আমার অধিকতর মঙ্গলই হবে। ''',
        'শ্লোক৩৬':
            '''সঞ্জয় বললেন- রণক্ষেত্রে এই কথা বলে অর্জুন তাঁর ধনুর্বাণ ত্যাগ করে শোকে ভারাক্রান্ত চিত্তে রথোপরি উপবেশন করলেন।''',
      },
    ),
    Chapter(title: '২.সাংখ্য যোগ', verse: {
      'শ্লোক১': '''সঞ্জয় উবাচ : 
তং তথা কৃপয়াবিষ্টমশ্রুপূর্ণাকুলেক্ষণম্।
বিষীদন্তমিদং বাক্যমুবাচ মধুসূদনঃ।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''সঞ্জয় বললেন-অর্জুনকে এভাবে অনুতপ্ত, ব্যাকুল ও অশ্রুসিক্ত দেখে, কৃপায় আবিষ্ট হয়ে মধুসূদন বা শ্রীকৃষ্ণ এই কথাগুলি বললেন। ''',
    }),
    Chapter(title: '৩.কর্ম যোগ', verse: {
      'শ্লোক১': '''অর্জুন উবাচ : 
জ্যায়সী চেৎ কর্মণস্তে মতা বুদ্ধির্জনার্দন।
তৎ কিং কর্মণি ঘোরে মাং নিয়োজয়সি কেশব।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''অর্জুন বললেন-হে জনার্দন! হে কেশব! যদি তোমার মতো কর্ম অপেক্ষা ভক্তি-বিষয়িনী বুদ্ধি শ্রেয়তর হয়, তাহলে এই ভয়ানক যুদ্ধে নিযুক্ত হওয়ার জন্য কেন আমাকে প্ররোচিত করছ?''',
    }),
    Chapter(title: '৪.জ্ঞান যোগ', verse: {
      'শ্লোক১': '''শ্রীভগবানুবাচ : 
ইমং বিবস্বতে যোগং প্রোক্তবানহমব্যয়ম্।।
বিবস্বান্মবে প্রাহ মনুরিক্ষ্বাকবেহব্রবীৎ।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''পরমেশ্বর ভগবান শ্রীকৃষ্ণ বললেন-আমি পূর্বে সূর্যদেব বিবস্বানকে এই অব্যয় নিষ্কাম কর্মসাধ্য জ্ঞানযোগ বলেচিলাম। সূর্য তা মানবজাতির জনক মনুকে বলেছিলেন এবং মনু তা ইক্ষ্বাকুকে বলেছিলেন।''',
    }),
    Chapter(title: '৫.কর্মসন্ন্যাস যোগ', verse: {
      'শ্লোক১': '''অর্জুন উবাচ : 
সন্ন্যাসং কর্মণাং কৃষ্ণ পুনর্যোগং চ সংসসি। 
যচ্ছ্রেয় এতয়োরেকং তন্মে ব্রুহি সুনিশ্চিতম্।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''অর্জুন বললেন- হে শ্রীকৃষ্ণ! প্রথমে তুমি আমাকে কর্ম ত্যাগ করতে বললে এবং তারপর কর্মযোগের অনুষ্ঠান করতে বললে। এই দুটির মধ্যে কোনটি অধিক কল্যাণকর, তা সুনিশ্চিতভাবে আমাকে বল। 
''',
    }),
    Chapter(title: '৬.ধ্যান যোগ', verse: {
      'শ্লোক১': '''শ্রীভগবানুবাচ : 
অনাশ্রিতঃ কর্মফলং কার্যং কর্ম করোতি যঃ। 
স সন্ন্যাসী চ যোগী চ ন নিরগ্নির্ন চাক্রিয়ঃ।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''পরমেশ্বর ভগবান বললেন- যিনি অগ্নিহোত্রাদি কর্ম ত্যাগ করেছেন এবং দৈহিক চেষ্টাশূন্য তিনি সন্যাসী বা যোগী নন। যিনি কর্মফলের প্রতি আসক্ত না হয়ে তাঁর কর্তব্য কর্ম করেন, তিনিই যথার্থ সন্নাসী বা যোগী।''',
    }),
    Chapter(title: '৭.বিজ্ঞান যোগ', verse: {
      'শ্লোক১': '''শ্রীভগবানুবাচ : 
ময্যাসক্তমনাঃ পার্থ যোগং যুঞ্জন্মদাশ্রয়ঃ। 
অসংশয়ং সমগ্রং মাং যথা  জ্ঞাস্যসি তচ্ছৃণু।। ১।।''',
    }, translation: {
      'শ্লোক১':
          '''শ্রীভগবান বললেন- হে পার্থ! আমাতে আসক্তচিত্ত হয়ে, আমাতে মনোনিবেশ করে যোগাভ্যাস করলে, কিভাবে সমস্ত সংশয় থেকে মুক্ত হয়ে আমাকে জানতে পারবে, তা শ্রবণ কর।''',
    }),
    Chapter(title: '৮.অক্ষরব্রহ্ম যোগ', verse: {
      'শ্লোক১': '''অর্জুন উবাচ : 
কিং তদ্ ব্রহ্ম কিমধ্যাত্মাং কিং কর্ম পুরুষোত্তম।
অধিভুতং চ কিং প্রোক্তমধিদৈবং কিমুচ্যতে।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''অর্জুন জিজ্ঞাসা করলেন-হে পুরুষোত্তম! ব্রহ্ম কি? অধ্যাত্ম কি? কর্ম কি? অধিভুত ও অধিদৈবই বা কাকে বলে? অনুগ্রহপূর্বক আমাকে স্পষ্ট করে বল।''',
    }),
    Chapter(title: '৯.রাজগূহ্য যোগ', verse: {
      'শ্লোক১': '''শ্রীভগবানুবাচ : 
ইদং তু তে গুহ্যতমং প্রবক্ষ্যাম্যনসূয়বে। 
জ্ঞানং বিজ্ঞানসহিতং যজজ্ঞাত্বা মোক্ষ্যসেহশুভাৎ।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''পরমেশ্বর ভগবান বললেন-হে অর্জুন! তুমি নির্মৎসর বলে তোমাকে আমি পরম বিজ্ঞান সমন্বিত সবচেয়ে গোপনীয় জ্ঞান উপদেশ করছি। সেই জ্ঞান প্রাপ্ত হয়ে তুমি দুঃখময় সংসার বন্ধন থেকে মুক্ত হও।''',
    }),
    Chapter(title: '১০.বিভূতি যোগ', verse: {
      'শ্লোক১': '''শ্রীভগবানুবাচ : 
ভূয় এব মহাবাহো শৃণু মে পরমং বচঃ।
যত্তেহহং প্রীয়মাণায় বক্ষ্যামি হিতকাম্যয়।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''পরমেশ্বর ভগবান বললেন- হে মহাবাহো! পুনরায় শ্রবণ কর। যেহেতু তুমি আমার প্রিয় পাত্র, তাই তোমার হিতকামনায় আমি পূর্বে যা বলেছি, তার থেকেও উৎকৃষ্ট তত্ত্ব বলছি।''',
    }),
    Chapter(title: '১১.বিশ্বরূপ দর্শন যোগ', verse: {
      'শ্লোক১': '''অর্জুন উবাচ : 
মদনুগ্রহায় পরমং গুহ্যমধ্যাত্মসংজ্ঞিতম্।
যত্ত্বয়োত্তং বচস্তেন মোহোহয়ং বিগতো মম।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''অর্জুন বললেন-আমার প্রতি অনুগ্রহ করে তুমি যে অধ্যাত্মতত্ত্ব সম্বন্ধীয় পরম গুহ্য উপদেশ আমাকে দিয়েছে, তার দ্বারা আমার এই মোহ দূর হয়েছে।''',
    }),
    Chapter(title: '১২.ভক্তি যোগ', verse: {
      'শ্লোক১': '''অর্জুন উবাচ : 
এবং সততযুক্তা যে ভক্তাস্ত্বাং পর্যুপাসতে। 
যে চাপ্যক্ষরমব্যক্তং তেষাং কে যোগবিত্তমাঃ।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''অর্জুন জিজ্ঞাসা করলেন-এভাবেই নিরন্তর ভক্তিযুক্ত হয়ে যে সমস্ত ভক্তেরা যথাযথভাবে তোমার আরাধনা করেন এবং যাঁরা ইন্দ্রিয়াতীত অব্যক্ত ব্রহ্মের উপাসনা করেন, তাঁদের মধ্যে কারা শ্রেষ্ঠ যোগী।''',
    }),
    Chapter(title: '১৩.প্রকৃতি পুরুষ বিবেক যোগ', verse: {
      'শ্লোক১': '''অর্জুন উবাচ : 
প্রকৃতিং পুরুষং চৈব ক্ষেত্রং ক্ষেত্রজ্ঞমেব চ।
এতদ্ বেদিকুমিচ্ছামি জ্ঞানং জ্ঞেয়ং চ কেশব।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''অর্জুন বললেন- হে কেশব! আমি প্রকৃতি, পুরুষ, ক্ষেত্র, ক্ষেত্রজ্ঞ, জ্ঞান ও জ্ঞেয়-এই সমস্ত তত্ত্ব জানতে ইচ্ছা করি।''',
    }),
    Chapter(title: '১৪.গুণত্রয় বিভাগ যোগগুণত্রয় বিভাগ যোগ', verse: {
      'শ্লোক১': '''শ্রীভগবানুবাচ : 
পরং ভূয়ঃ প্রবক্ষ্যামি জ্ঞানানং জ্ঞানমুত্তমম্। 
যজজ্ঞাত্বা মুনয়ঃ সর্বে পরাং সিদ্ধিমিতো গতাঃ।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''পরমেশ্বর ভগবান বললেন-পুনরায় আমি তোমাকে সমস্ত জ্ঞানের মধ্যে সর্বোত্তম জ্ঞান সম্বন্ধে বলব, যা জেনে মুনিগণ এই জড় জগৎ থেকে পরম সিদ্ধি লাভ করেছিলেন।''',
    }),
    Chapter(title: '১৫.পুরুষোত্তম যোগ', verse: {
      'শ্লোক১': '''শ্রীভগবানুবাচ : 
ঊর্ধ্বমূলমধঃশাখমশ্বত্থং প্রাহুরব্যয়ম্।
ছন্দাংসি যস্য পর্ণানি যন্তং বেদ স বেদবিৎ।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''পরমেশ্বর ভগবান বললেন-ঊর্ধ্বমূল ও অধঃশাখা-বিশিষ্ট একটি অব্যয় অশ্বত্থ বৃক্ষের কথা বলা হয়েছে। বৈদিক মন্ত্রসমূহ সেই বৃক্ষের পত্রস্বরূপ। যিনি সেই বৃক্ষটিকে জানেন, তিনিই বেদজ্ঞ।''',
    }),
    Chapter(title: '১৬.দৈবসুর সম্পদ বিভাগ যোগ', verse: {
      'শ্লোক১': '''শ্রীভগবানুবাচ : 
অভয়ং সত্ত্বসংশুদ্ধির্জ্ঞানযোগব্যবস্থিতিঃ।
দানং দমশ্চ যজ্ঞশ্চ স্বাধ্যায়স্তপ আর্জবম্।।১।।
অহিংসা সত্যমক্রোধস্ত্যাগঃ শান্তিরপৈশুনম্।
দয়া ভূতেষ্বলোলুপ্ত্বং মার্দবং হ্রীরচাপলম্।।২।।
তেজঃ ক্ষমা ধৃতিঃ শৈৗচমদ্রোহো নাতিমানিতা।
ভবন্তি সম্পদং দৈবীমভিজাতস্য ভারত।।৩।।''',
    }, translation: {
      'শ্লোক১':
          '''পরমেশ্বর ভগবান বললেন-হে ভারত! ভয়শূন্যতা, সত্তার পবিত্রতা, পারমার্থিক জ্ঞানের অনুশীলন, দান, আত্মসংযম, যজ্ঞ অনুষ্ঠান, বৈদিক শাস্ত্র অধ্যয়ন, তপশ্চর্যা, সরলতা, অহিংসা, সত্যবাদিতা, ক্রোধশূন্যতা, বৈরাগ্য, শান্তি, অন্যের দোষ দর্শন না করা, সমস্ত জীবে দয়া, লোভহীনতা, মৃদুতা, লজ্জা, অপচলতা, তেজ, ক্ষমা, ধৈর্য, শৌচ, মাৎসর্য শূন্যতা, অভিমান শূন্যতা- এই সমস্ত গুণগুলি দিব্যভাব সমন্বিত ব্যক্তিদের মধ্যে দেখা যায়।''',
    }),
    Chapter(title: '১৭.শ্রদ্ধত্রয় বিভাগ যোগ', verse: {
      'শ্লোক১': '''অর্জুন উবাচ : 
যে শাস্ত্রবিধিমুৎসৃজ্য যজন্তে শ্রদ্ধয়ান্বিতাঃ। 
তেষাং নিষ্ঠা তু কা কৃষ্ণ সত্ত্বমাহো রজস্তমঃ।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''অর্জুন জিজ্ঞাসা করলেন- হে কৃষ্ণ! যারা শাস্ত্রীয় বিধান পরিত্যাগ করে শ্রদ্ধা সহকারে দেব-দেবীর পূজা করে, তাদের সেই নিষ্ঠা কি সাত্ত্বিক, রাজসিক না তামসিক?।''',
    }),
    Chapter(title: '১৮.মোক্ষ যোগ', verse: {
      'শ্লোক১': '''অর্জুন উবাচ : 
সন্ন্যাসস্য মহাবাহো তত্ত্বমিচ্ছামি বেদিতুম্।
ত্যাগস্য চ হৃষীকেশ পৃথক্কেশিনিসূদন।।১।।''',
    }, translation: {
      'শ্লোক১':
          '''অর্জুন বললেন- হে মহাবাহো! হে হৃষীকেশ! হে কেশিনিসূদন! আমি সন্ন্যাস ও ত্যাগের তত্ত্ব পৃথকভাবে জানতে ইচ্ছা করি।''',
    })
  ];
}
