class Summary {
  static Map<String, String> summary = {
    '১. বিষাদ যোগ':
        '''যুদ্ধক্ষেত্রে অর্জুন দেখেন, কৌরব বাহিনী সামনে দাঁড়িয়ে আছে। তার আত্মীয়-স্বজন, বন্ধু-বান্ধব, গুরুজন প্রভৃতি এই সেনাবাহিনীতে রয়েছেন। যাদের সাথে তাকে যুদ্ধ করতে হবে। তাদেরকে হত্যা করার কথা ভেবে অর্জুন দুঃখ ও অপরাধবোধে ভুগতে শুরু করেন। তিনি তার ধনুক নামিয়ে রাখেন। তাঁর সারথি ভগবান শ্রী কৃষ্ণকে জিজ্ঞাসা করেন, “আমি কীভাবে আমার নিজের লোকদের সাথে যুদ্ধ করব?” এই কথা বলে তিনি অসহায় ভঙ্গিতে রথের উপর বসে পড়েন।''',
    '২. সাংখ্য যোগ':
        '''শ্রীকৃষ্ণ অর্জুনকে বলেন, “তুমি বৃথা চিন্তা কর কেন? আত্মা অমর। সে কখনো মরে না। শুধু এই শরীর মরে। এই পৃথিবী এবং এর মানুষ তোমার সৃষ্টি নয়। ওদের প্রেমে নিজেকে জড়াচ্ছো কেন? তাদেরকে হারানোর শোক কেন? তারা সবাই এর পূর্বে বহুবার মারা গেছেন এবং তাদের জন্ম হয়েছে প্রত্যেক বার।” ধর্মরক্ষার জন্য এই যুদ্ধ তোমাকে করতেই হবে। এটাই হল একজন ক্ষত্রিয়র কর্তব্য। এই কথা শুনে অর্জুন শ্রী কৃষ্ণকে বলেন যে তার মনে এখনও অনেক সংশয় আছে। এরপর তিনি শ্রীকৃষ্ণকে সবকিছু বিস্তারিত বলার জন্য অনুরোধ করেন।''',
    '৩. কর্ম যোগ':
        '''শ্রী কৃষ্ণ বলেন, “হে অর্জুন এই পৃথিবীতে প্রত্যেকেরই নিজের কর্তব্য পালন করা উচিত। কিন্তু ফল প্রাপ্তির আশা করা উচিত নয়।” কোন কিছুর আসক্ত না হয়ে কাজ করতে হবে এবং সেই কর্ম ধর্মানুসারে করা করতে হবে। সমস্ত কর্ম ঈশ্বরের প্রতি উৎসর্গ করা উচিত। এমনকি যদি তুমি যুদ্ধ না করো, তবে সেটাও একটি কর্ম হবে। কিন্তু এর ফলে পৃথিবীতে পাপী লোকের সংখ্যা বাড়তে থাকবে। যার ফলে সর্বত্র পাপ ছড়িয়ে পড়বে। এজন্য তুমি তোমার মোহো ছেড়ে যুদ্ধ শুরু করো। এটাই তোমার কর্তব্য।''',
    '৪. জ্ঞান যোগ':
        '''এই অধ্যায়ে ভগবান শ্রীকৃষ্ণ গীতার পৌরাণিক ইতিহাস বর্ণনা করেছেন। সর্বপ্রথম তিনি সূর্য দেবকে (বিভাসাবন) গীতার জ্ঞান দিয়েছিলেন। এরপর সূর্য দেব তাঁর শিষ্যদের সেই জ্ঞান দিয়েছিলেন এবং এই জ্ঞান এভাবেই সবত্র ছড়িয়ে পড়তে থাকে। ভগবান বলেছেন, “যখনই ধর্ম ধ্বংসের পথে অগ্রসর হয়, তখনই তিনি এই পৃথিবীতে অবতারিত হন।” এই যুদ্ধের রঙ্গমঞ্চ তিনি এমনভাবে সাজিয়েছেন যেন পাপীরা শাস্তি পায়। কিন্তু যারা তার প্রতি সমর্পিত হন, তিনি তাদের অবশ্যই রক্ষা করেন। এই যুদ্ধ তিনিই সৃষ্টি করেছেন যাতে পাপীদের শাস্তি হয়।''',
    '৫. কর্মসন্ন্যাস যোগ':
        '''শ্রীকৃষ্ণ বলেছেন, সন্ন্যাস মানে জাগতিক মোহো মায়া থেকে বিচ্ছিন্ন হয়ে ঈশ্বরের উপাসনা করা। কিন্তু সন্ন্যাস গ্রহণের জন্য সবার অরণ্যে যাওয়ার প্রয়োজন নেয়। কর্তব্য পালনের সময় বস্তুগত আনন্দে মোহো না থাকলেও ভগবানকে লাভ করা যায়।''',
    '৬. ধ্যান যোগ':
        '''ধ্যানের মাধ্যমে একজন মানুষ তার ইন্দ্রিয়কে নিয়ন্ত্রণ করতে পারে। বাইরের জিনিস থেকে মনোযোগ সরিয়ে শুধুমাত্র ঈশ্বরের ধ্যান করা উচিত। নিরন্তর অনুশীলনের মাধ্যমে ধ্যানকারী যোগী হয়ে ওঠেন। তিনি প্রকৃত সুখ পেতে শুরু করেন এবং কোন কিছু নিয়ে চিন্তিত বা ভীত হন না। তিনি ভগবানের ভক্ত হয়ে যান। ধ্যানের শেষ অবস্থা হল সমাধি। এই পর্যায়ে পৌঁছে যোগী ঈশ্বরের সাক্ষাত পান।''',
    '৭. বিজ্ঞান যোগ':
        '''শ্রী কৃষ্ণ বলেছেন যে মহাবিশ্বের সবকিছু তাঁর দ্বারা সৃষ্ট। সব কিছুতেই তিনি উপস্থিত। সূর্য, পৃথিবী, গ্রহ, নক্ষত্র, জ্ঞান-বিজ্ঞান, ইন্দ্রিয়, সুখ, দুঃখ, পাপ, পুণ্য ইত্যাদি সবই তাঁর তৈরি। যারা জ্ঞানের দ্বারা এই বিষয়টি বোঝে, তারা ভগবানের ভক্ত হয়ে যান। যারা সন্দেহ করে তারা জগতের জড় বস্তুর প্রতি নিবেদিত হয়ে পড়ে। আর এটাই হয় তাদের দুঃখের কারণ। তারা কখনও বৈকুণ্ঠ (মোক্ষ) পায় না এবং মৃত্যু লোকে বারবার জন্ম নিতে হয়, পার্থিব দুঃখ-কষ্ট ভোগ করতে হয়।''',
    '৮. অক্ষরব্রহ্ম যোগ':
        '''এই অধ্যায়ে শ্রীকৃষ্ণ অর্জুনকে ব্রহ্ম ও আত্মা ইত্যাদি সম্পর্কে বলেছেন। কৃষ্ণ বলে “অহম ব্রহ্মাস্মি” অর্থাৎ “আমি ব্রহ্ম“। আর যেহেতু মানুষের আত্মাও ভগবানের অংশ, তাই মানুষও ব্রহ্ম। মানুষ এসব জানতে পারে না, কারণ তাদের বুদ্ধি মোহোর আবরণে আবৃত থাকে। শ্রীকৃষ্ণ আরও বলেছেন যে অন্যান্য সমস্ত দেব-দেবীও কেবল তাঁর দ্বারাই সৃষ্টি হয়েছিল। তাঁর আরাধনা করা মানেই পরমব্রহ্ম অর্থাৎ শ্রী কৃষ্ণেরও পূজা করা। যারা কৃষ্ণের ধ্যান করেন এবং মৃত্যুর সময় কৃষ্ণের উপাসনা করেন তিনি তাদের মোক্ষ অর্থাৎ মুক্তি দান করেন।''',
    '৯. রাজগূহ্য যোগ':
        '''এই অধ্যায়ে শ্রীকৃষ্ণ বলেছেন, পৃথিবীতে সবচেয়ে বড় রহস্য হল – কৃষ্ণই ঈশ্বর। তিনিই মহাবিশ্ব সৃষ্টি করেছেন। প্রতিটি কণাতে তিনি বিরাজমান। এগুলো বোঝা মানুষের নিয়ন্ত্রণে নেয়। কিন্তু তাঁর উপাসনা করে যে কেউ তাঁকে লাভ করতে পারেন। উপরন্তু এই ভক্তি সন্দেহ ও সংশয়হীন হওয়া উচিত এবং এর মধ্যে শুধু ভগবান শ্রীকৃষ্ণের প্রতি ভালোবাসা থাকা উচিত।''',
    '১০. বিভূতি যোগ':
        '''এই পৃথিবীতে যত ভাল-মন্দ গুণ আছে যেমন- জ্ঞান, সৌন্দর্য, শক্তি, ভয়, সাহস, হিংসা ইত্যাদি সবই শ্রীকৃষ্ণের সৃষ্টি। যারা কৃষ্ণে বিশ্বাস করে তারা ভালো গুণাবলী অর্জন করেন। আর যারা তা করে না তারা খারাপ গুণাবলী অর্জন করেন। ঈশ্বর তাদের উভয়কে তাদের কর্ম অনুসারে উপযুক্ত ফল বা শাস্তি প্রদান করেন।''',
    '১১. বিশ্বরূপ দর্শন যোগ':
        '''এই অধ্যায়ে শ্রীকৃষ্ণ অর্জুনকে তাঁর বিরাট রূপ দেখান। অর্জুন দেখেন যে এই রূপ তিন জগত ব্যপী বিস্তৃত। সমগ্র বিশ্বে তাঁর প্রতিচ্ছবি রয়েছে। তাঁর চারটি হাত। আর আছে অসংখ্য মাথা। কিছু মাথা নিখুঁতভাবে ভীতিকর এবং কিছু সৌম্য দর্শন। কোন কোন মুখ থেকে আগুন, জল ইত্যাদি বের হচ্ছে। তাঁদের একদিক থেকে জন্ম নিয়ে পৃথিবীর দিকে আসছে বিভিন্ন প্রাণীরা। আর অন্যদিকে মৃত্যুর গালে ঢলে পড়ছে তারা। জন্ম মৃত্যু সবই শ্রীকৃষ্ণের মাধ্যমে। এই সব দেখে অর্জুন বিস্মিত হন এবং প্রভুর চরণে শ্রদ্ধার সাথে মাথা নত করেন।''',
    '১২. ভক্তি যোগ':
        '''শ্রীকৃষ্ণ বলেছেন সবচেয়ে বড় যোগ হল ভক্তিযোগ। কেউ যদি বড় বড় বেদ-পুরাণ পড়তে না পারে; যজ্ঞ, হবন, তপস্যা করতে না পারে; তবে তার উচিত ভক্তিযোগের আশ্রয় নেওয়া। মানুষের ঈশ্বরের প্রেমে মগ্ন হয়ে তাঁর ভক্তি করা উচিত। তাঁর স্তব গাওয়া উচিত। তাঁর মনন, চিন্তন, ধ্যান এবং প্রশংসা করা উচিত। নিজেকে সম্পূর্ণরূপে শ্রীকৃষ্ণের চরণে সমর্পণ করা উচিত। এমন ভক্তদের শ্রীকৃষ্ণের খুব ভালবাসেন এবং তিনি নিজেই তাদের ভক্ত হয়ে যান। এমনই প্রকৃত ভক্ত ছিল মীরা ও সুরদাস। ভগবান এমন ভক্তদের মোক্ষ দান করেন।''',
    '১৩. প্রকৃতি পুরুষ বিবেক যোগ':
        '''যে মানব দেহ, আত্মা, পরমাত্মা ও জ্ঞানের এই রহস্য বোঝে, সেই এই জগতের বন্ধন থেকে মুক্তি লাভ করে। আত্মার মধ্যেই ঈশ্বরের বাস। কারণ তিনি আত্মার অংশ। কিন্তু অজ্ঞতার কারণে মানুষ তা বুঝতে পারে না। তাই আগে জ্ঞান অর্জন করতে হবে। জ্ঞানের উদ্দেশ্য হল ঈশ্বরকে বোঝা। তবে এর জন্য মানুষকে সদাচারী হতে হবে। অন্যথায় মানুষ অহংকারী হবে। তখন সে এই রহস্য বুঝতে পারবে না। আর সে নিজের মধ্যে ঈশ্বরকেও খুঁজে পাবে না।''',
    '১৪. গুণত্রয় বিভাগ যোগগুণত্রয় বিভাগ যোগ':
        '''এই অধ্যায়ে শ্রীকৃষ্ণ তিনটি গুণের কথা বলেছেন। এই তিনটি গুণ – সাত্ত্বিক, তামসিক এবং রাজসিক। সাত্ত্বিক লোকেরা নিরামিষ আহার করে, সাধারণ পোশাক পরে, কথায় নরম হয় এবং ভগবানের ভক্তি করে। তারা মৃত্যুর পর মোক্ষ লাভ করেন। তামসিক প্রবৃত্তির লোকেরা আমিষ খাবার খান, নোংরা পোশাক পরে, হিংস্র হয় এবং কখনো ঈশ্বরের উপর ভক্তি দেখায় না। মৃত্যুর পর তারা নরক ভোগ করেন। রাজস্বিক লোকেরা ভোগ ও বিলাসের প্রতি আগ্রহ দেখায়, তাদের মধ্যে উভয়ের গুণ থাকে। মৃত্যুর পর তারা তাদের কর্ম অনুসারে স্বর্গ ও নরক উভয়ই পেতে পারেন।''',
    '১৫. পুরুষোত্তম যোগ':
        '''বেদের সমস্ত জ্ঞানের সারমর্ম এই যে মানুষকে মোহো মায়া ত্যাগ করে ঈশ্বরের চরণে সমর্পণ করতে হবে। এটাই সবচেয়ে বড় যোগ। মোহের কারণে মানুষ ভগবানকে লাভ করতে পারেন না। কারণ তার মন অর্থ এবং অন্যান্য বস্তুগত জিনিসকে ভালবাসতে শুরু করে। এটি তাকে ঈশ্বর উপলব্ধির পথ থেকে দূরে সরিয়ে রাখে। সর্বোত্তম মানুষ সেই যে আসক্তি ত্যাগ করে নিজেকে ঈশ্বরের ভক্তিতে উৎসর্গ করেন।''',
    '১৬. দৈবসুর সম্পদ বিভাগ যোগ':
        '''মানুষের মধ্যে দুই ধরনের প্রবৃত্তি পাওয়া যায়: দেব ও দানব। দেব মনোভাব যাদের আছে তাদের অনেক ভালো গুণ থাকে। যেমন – সেবা, সংযম, সত্যবাদিতা, সততা, পরিচ্ছন্নতা, শান্তি ইত্যাদি। তারা মোক্ষ লাভের যোগ্য। বিপরীতে, আসুরিক প্রবৃত্তির লোকেদের মধ্যে খারাপ গুণ থাকে। যেমন – অহংকার, ঈর্ষা, ক্রোধ, কাম-বাসনা, লালসা, হিংসা ইত্যাদি। তারা নরক লাভ করেন।''',
    '১৭. শ্রদ্ধত্রয় বিভাগ যোগ':
        '''অর্জুন জিজ্ঞাসা করলেন – বেদ ও পুরাণ ছাড়া যারা নিজ ইচ্ছায় ভক্তি করতে চায় তাদের কি করা উচিত? শ্রী কৃষ্ণ বলেছেন – তাদের উচিত “ওম(ॐ) তত সত” অনুসরণ করা। ওম মানে ঈশ্বর, তত মানে মোহো থেকে দূরে থাকা, সত মানে সত্য। অর্থাৎ একজন মানুষের মোহো মায়া থেকে দূরে থেকে, সত্য পথে চলে ঈশ্বরের উপাসনা করা উচিত। এমন মানুষকে ভগবান নিজের আশ্রয়ে নিয়ে পরিত্রাণ দান করেন।''',
    '১৮. মোক্ষ যোগ':
        '''এই অধ্যায়ে ভগবান শ্রীকৃষ্ণ অর্জুনকে মোক্ষ লাভের পথ ব্যাখ্যা করেছেন। তিনি বলেন যে, মোক্ষলাভের জন্য একজন মানুষকে সমস্ত জিনিসের প্রতি আসক্তি ত্যাগ করে সম্পূর্ণরূপে ঈশ্বরের কাছে আত্মসমর্পণ করতে হবে। আমাদের জীবনের প্রতিটি কর্ম শুধুমাত্র শ্রীকৃষ্ণকে উৎসর্গ করা উচিত। তাঁর প্রতি অগাধ ভালবাসা রাখতে হবে। তাঁর প্রতি পূর্ণ আস্থা রাখা উচিত। তার পূজা করা উচিত এবং সন্ন্যাসীর মতো, সমস্ত বস্তু থেকে মোহো ত্যাগ করতে হবে। এভাবে জীবন যাপন করলে মানুষ অবশ্যই মোক্ষ লাভ করবে। শেষে শ্রীকৃষ্ণ অর্জুনকে বলেন যে সে যদি এখনও যুদ্ধ করতে না চায় তবে সে চলে যেতে পারে। কিন্তু বিধির বিধান হবেই। তার পরিবর্তে অন্য কেউ যুদ্ধ করবে। কিন্তু অর্জুনের সমস্ত সন্দেহের অবসান ঘটেছিল। তিনি ভগবান শ্রীকৃষ্ণকে প্রণাম করেন এবং ধর্ম যুদ্ধের জন্য প্রস্তুত হন।''',
  };

  static Map<String, String> usecase = {
    '১. বিষাদ যোগ':
        '''আমাদের অধ্যয়নের সময় যদি আমরা সামনে আসা সমস্যা বা বিষয়ে চিন্তিত থাকি, তাহলে আমরা প্রাথমিক ধারণা গ্রহণ করতে পারি এবং বিশুদ্ধ মনে স্থিতি করতে পারি।''',
    '২. সাংখ্য যোগ':
        '''আমরা আমাদের কর্মের ফলে আসা সমস্যা সহ্য করতে এবং আত্মবল অর্জন করতে শিক্ষা পাই।''',
    '৩. কর্ম যোগ':
        '''আমরা যেমন করতে প্রস্তুত হই, তেমনই যেন আমরা করি, এবং আমাদের কর্মের ফলে বাধা অথবা লাভ পেতে আমরা নিজেদের সমর্পণ করি।''',
    '৪. জ্ঞান যোগ':
        '''জীবনের প্রত্যেকটি ক্ষণই আমাদের আত্মজ্ঞানে আমাদের নিজেকে আমরা উন্নত করতে এবং আমাদের উন্নতি এবং উন্নত জীবনে সহায়ক হতে পারে।''',
    '৫. কর্মসন্ন্যাস যোগ':
        '''আমরা কর্মের ফলে অপেক্ষা ছেড়ে দেয়া এবং নিজেদের উন্নত ও পরিপূর্ণ ব্যক্তি হিসেবে প্রকাশ করা শেখা।''',
    '৬. ধ্যান যোগ':
        '''ধ্যান মাধ্যমে আমরা মনস্থির ও স্থির মনের সাথে জীবনে উন্নতি করতে পারি এবং আনন্দ এবং শান্তি অর্জন করতে পারি।''',
    '৭. বিজ্ঞান যোগ':
        '''আমরা পরমাত্মার অসীম শক্তি এবং জ্ঞানে আমাদের মনোবল বৃদ্ধি এবং শান্তি পেতে কোনও যাত্রায় একপথে হেতুপাত করতে পারি।''',
    '৮. অক্ষরব্রহ্ম যোগ':
        '''আমরা জীবনের শেষ মুহূর্তে আমাদের মৃত্যুর পরবর্তী জীবনের প্রস্থান সম্পর্কে আলোচনা করি এবং পরমাত্মার দিকে মনোনিবেশ করি।''',
    '৯. রাজগূহ্য যোগ':
        '''ভগবান কৃষ্ণ আমাদের প্রতি আপনার অসীম ভালোবাসা এবং মর্যাদা প্রদান করেন, এবং তার উপাস্য এবং উপাস্যযোগ্য স্বরূপ সম্পর্কে আমাদের শিক্ষা দেয়।''',
    '১০. বিভূতি যোগ':
        '''ভগবানের অসীম গুণগত মহাত্ম্য এবং উন্নত সম্পদ বিভিন্ন দেশ, জীবন, বৃত্তি, শক্তি এবং গুণগত বিভিন্ন রূপ সম্পর্কে আমাদের উদাহরণ দেয়।''',
    '১১. বিশ্বরূপ দর্শন যোগ':
        '''ভগবান কৃষ্ণ তার বিশ্বরূপ দর্শন দেখান, যেটি মহাবিশ্বের সমস্ত বিশাল ও অসীম সৃষ্টি এবং তার অদ্ভুত রূপ সম্পর্কে আমাদের জ্ঞান বৃদ্ধি এবং উন্নতি প্রদান করে।''',
    '১২. ভক্তি যোগ':
        '''আমরা ভগবানের প্রতি ভালোবাসা এবং পরমাত্মার দিকে শ্রদ্ধার সাথে একটি প্রিয় সম্পর্ক উন্নত করতে পারি।''',
    '১৩. প্রকৃতি পুরুষ বিবেক যোগ':
        '''প্রকৃতি, পুরুষ এবং দ্বারা আমাদের শরীর এবং মানসিক অবস্থা নিয়ন্ত্রণ করা শেখা, যাতে আমরা আমাদের মনোবল এবং ব্যক্তিগত উন্নতি প্রদান করতে পারি।''',
    '১৪. গুণত্রয় বিভাগ যোগগুণত্রয় বিভাগ যোগ':
        '''আমাদের ব্যক্তিগত গুণ এবং আমাদের আচরণের সাথে প্রকৃতির গুণগত সংযোজন বুঝতে এবং আমাদের চরিত্র বৃদ্ধি করতে শেখা।''',
    '১৫. পুরুষোত্তম যোগ':
        '''আমরা ভগবানের প্রতি আমাদের ভক্তির মাধ্যমে পরমাত্মার সাথে সাক্ষাত্কার করতে পারি এবং আমরা সমস্ত বন্ধন এবং অবশ্য মুক্তি পেতে পারি।''',
    '১৬. দৈবসুর সম্পদ বিভাগ যোগ':
        '''দৈবী গুণগুলি আমাদের জীবনে শান্তি, শুভকর্ম এবং আনন্দ তৈরি করতে সাহায্য করে, যেখানে যান্ত্রিক গুণগুলি বিপর্যস্ত ফলাফল সৃষ্টি করে।''',
    '১৭. শ্রদ্ধত্রয় বিভাগ যোগ':
        '''আমাদের আচরণের আধারে তিনটি শ্রদ্ধা প্রদানের পরিমাণ বিবেচনা এবং আমরা যেভাবে পরমাত্মার প্রতি আমাদের ভালোবাসা এবং অবাক প্রদান করতে পারি তা শেখা।''',
    '১৮. মোক্ষ যোগ':
        '''ভগবান কৃষ্ণ আমাদের জীবনের উদ্দেশ্য এবং কর্মের নিজেকে সমর্পণ করার মাধ্যমে মোক্ষ অর্জন করার উপায় বোঝান।''',
  };
}
